# Start Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextRange..::..Start Property
TextRange Class See Also
---
The start index of a range within the FormattedText.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int Start { get; set; }
```

Visual Basic
---
```text
Public Property Start As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Start {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for start is negative. |

# See Also
TextRange Class
Autodesk.Revit.DB Namespace